InformationRegisters/ОбновлениеАналитикиОстатковОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОбновлениеАналитикиОстатковОтпусков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЕжегодногоОтпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтпусков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АналитикаОстатковОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>АналитикаОстатковОтпусков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОстатокДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоВСтруктуреПредприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЕжегодногоОтпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтпусков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НачальныеОстаткиОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НачальныеОстаткиОтпусков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РабочийГодОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЕжегодногоОтпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтпусков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОстатка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийГодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтудентРаботающийВСтудотряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыОтпусков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтпускЯвляетсяЕжегодным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаОтпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаОтпуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставлятьОтпускВсемСотрудникам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейВГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтпускБезОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойОтпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НакопительныйОтпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерЗависимостиДнейОтпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХарактерЗависимостиКоличестваДнейОтпуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСтажа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШкалаОценкиСтажа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВерхняяГраницаИнтервалаСтажа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДнейВГод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОстаткиОтпусковАналитикаДанных/Ext/Module.bsl
// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.24.202";
	Обработчик.Процедура = "ОстаткиОтпусковАналитикаДанных.ПриНачальномЗаполненииПодсистемыАналитикаДанных";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("72f8dd7b-f6bc-11ec-8499-ca102586f8a5");
	Обработчик.Комментарий = НСтр("ru = 'Начальное заполнение аналитики данных: остатки отпусков.'");
	
КонецПроцедуры

// Процедура выполняет начальное заполнение аналитики данных
//
// Параметры:
//  ПараметрыОбновления - Структура - описывает текущие параметры обновления:
//   * ОбработкаЗавершена - Булево
//
Процедура ПриНачальномЗаполненииПодсистемыАналитикаДанных(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	АналитикаДанных.СоздатьВТСотрудники(Запрос);
	
	ОписательВременныхТаблиц = ОстаткиОтпусков.ОписательВременныхТаблицДляСоздатьВТЗаработанныеПраваНаОтпуска(
		Запрос.МенеджерВременныхТаблиц, "ВТСотрудники", "Сотрудник, ДатаНачала, ДатаОкончания");
	ОстаткиОтпусков.СоздатьВТЗаработанныеПраваНаОтпуска(ОписательВременныхТаблиц, Истина);
	
	ОписательВременныхТаблиц = ОстаткиОтпусков.ОписательВременныхТаблицДляСоздатьВТФактическиеОтпускаСотрудников(
		Запрос.МенеджерВременныхТаблиц, "ВТСотрудники", "Сотрудник, ДатаНачала, ДатаОкончания");
	ОстаткиОтпусков.СоздатьВТФактическиеОтпускаСотрудников(ОписательВременныхТаблиц, Истина);
	
	ДатаНачалаАналитики = АналитикаДанных.ДатаНачалаАналитики();
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(МенеджерВременныхТаблиц, ДатаНачалаАналитики, ТекущаяДатаСеанса());
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаАналитики);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбновлениеАналитики.Сотрудник КАК Сотрудник,
		|	ОбновлениеАналитики.ВидЕжегодногоОтпуска КАК ВидЕжегодногоОтпуска
		|ПОМЕСТИТЬ ВТОбновлениеАналитикиОстатковОтпусков
		|ИЗ
		|	РегистрСведений.ОбновлениеАналитикиОстатковОтпусков КАК ОбновлениеАналитики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаработанныеПраваНаОтпуска.Период КАК Период,
		|	ЗаработанныеПраваНаОтпуска.Сотрудник КАК Сотрудник,
		|	ЗаработанныеПраваНаОтпуска.ВидЕжегодногоОтпуска КАК ВидЕжегодногоОтпуска
		|ПОМЕСТИТЬ ВТОстатковОтпусков
		|ИЗ
		|	ВТЗаработанныеПраваНаОтпуска КАК ЗаработанныеПраваНаОтпуска
		|ГДЕ
		|	НЕ (ЗаработанныеПраваНаОтпуска.Сотрудник, ЗаработанныеПраваНаОтпуска.ВидЕжегодногоОтпуска) В
		|		(ВЫБРАТЬ
		|			ОбновлениеАналитики.Сотрудник,
		|			ОбновлениеАналитики.ВидЕжегодногоОтпуска
		|		ИЗ
		|			ВТОбновлениеАналитикиОстатковОтпусков КАК ОбновлениеАналитики)
		|	И ЗаработанныеПраваНаОтпуска.Период > &ДатаНачала
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФактическиеОтпуска.ДатаНачала КАК Период,
		|	ФактическиеОтпуска.Сотрудник,
		|	ФактическиеОтпуска.ВидЕжегодногоОтпуска
		|ИЗ
		|	ВТФактическиеОтпускаСотрудников КАК ФактическиеОтпуска
		|ГДЕ
		|	НЕ (ФактическиеОтпуска.Сотрудник, ФактическиеОтпуска.ВидЕжегодногоОтпуска) В
		|		(ВЫБРАТЬ
		|			ОбновлениеАналитики.Сотрудник,
		|			ОбновлениеАналитики.ВидЕжегодногоОтпуска
		|		ИЗ
		|			ВТОбновлениеАналитикиОстатковОтпусков КАК ОбновлениеАналитики)
		|	И ФактическиеОтпуска.ДатаНачала > &ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	МИНИМУМ(ОстатковОтпусков.Период) КАК Дата,
		|	ОстатковОтпусков.Сотрудник КАК Сотрудник,
		|	ОстатковОтпусков.ВидЕжегодногоОтпуска КАК ВидЕжегодногоОтпуска
		|ИЗ
		|	ВТОстатковОтпусков КАК ОстатковОтпусков
		|СГРУППИРОВАТЬ ПО
		|	ОстатковОтпусков.Сотрудник,
		|	ОстатковОтпусков.ВидЕжегодногоОтпуска";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	ЗарегистрироватьОбновлениеАналитикиОстатковОтпусков(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

// См. СинхронизацияДанныхЗарплатаКадрыИнтеграцияПодсистем.ЗаполнитьТаблицуЗависимыхДанных.
Процедура ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные) Экспорт
	
	// Метаданные.РегистрыСведений.ЗаработанныеПраваНаОтпуска
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.РегистрыСведений.ЗаработанныеПраваНаОтпуска;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.ОбновлениеАналитикиОстатковОтпусков;
	
	// Метаданные.РегистрыНакопления.ФактическиеОтпуска
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.РегистрыНакопления.ФактическиеОтпуска;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.ОбновлениеАналитикиОстатковОтпусков;
	
КонецПроцедуры

#КонецОбласти

#Область РегламентныеЗадания

Процедура ПриОбновленииАналитикиДанных() Экспорт
	ОбновитьАналитикуОстатковОтпусков();
КонецПроцедуры

// Заполняет таблицу обновления заработанных прав на отпуска.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ЗаработанныеПраваНаОтпуска
Процедура ЗаполнитьТаблицуОбновленияЗаработанныхПравНаОтпуска(Источник) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("ТаблицаОбновленияЗаработанныхПравНаОтпуска",
		ТаблицаОбновленияЗаработанныхПравНаОтпуска(Источник));
	
КонецПроцедуры

// Заполняет таблицу обновления фактических отпусков.
// 
// Параметры:
//  Источник - РегистрНакопленияНаборЗаписей.ФактическиеОтпуска
Процедура ЗаполнитьТаблицуОбновленияФактическихОтпусков(Источник) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("ТаблицаОбновленияФактическихОтпусков",
		ТаблицаОбновленияФактическихОтпусков(Источник));
	
КонецПроцедуры

#КонецОбласти

// При инициализации наборов регистров обновления аналитики данных.
// 
// Параметры:
//  НаборРегистров - Массив - См. АналитикаДанныхВнутренний.НаборРегистровОбновленияАналитикиДанных
Процедура ПриИнициализацииНаборовРегистровОбновленияАналитикиДанных(НаборРегистров) Экспорт
	НаборРегистров.Добавить(Метаданные.РегистрыСведений.ОбновлениеАналитикиОстатковОтпусков.ПолноеИмя());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодключениеСобытийОбновленияАналитикиДанных

// Зарегистрировать изменение заработанных прав на отпуска.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ЗаработанныеПраваНаОтпуска - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура ЗарегистрироватьИзменениеЗаработанныхПравНаОтпускаДляАналитикиДанныхПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьОбновлениеАналитикиОстатковОтпусков(ТаблицаОбновленияЗаработанныхПравНаОтпуска(Источник));
	
КонецПроцедуры

// Зарегистрировать изменение фактических отпусков.
// 
// Параметры:
//  Источник - РегистрНакопленияНаборЗаписей.ФактическиеОтпуска - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура ЗарегистрироватьИзменениеФактическихОтпусковДляАналитикиДанныхПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьОбновлениеАналитикиОстатковОтпусков(ТаблицаОбновленияФактическихОтпусков(Источник));
	
КонецПроцедуры

#КонецОбласти

// Регистрация обновления аналитики остатков отпусков.
// 
// Параметры:
//  ТаблицаОбновления - См. НоваяТаблицаОбновлениеАналитикиОстатковОтпусков
Процедура ЗарегистрироватьОбновлениеАналитикиОстатковОтпусков(ТаблицаОбновления) Экспорт
	
	Если ТаблицаОбновления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОбновления = СвернутаяТаблицаОбновленияАналитикиОстатковОтпусков(ТаблицаОбновления);
	
	УстановитьПривилегированныйРежим(Истина);
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ОбновлениеАналитикиОстатковОтпусков");
	ЭлементБлокировкиДанных.ИсточникДанных = ТаблицаОбновления;
	ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("ВидЕжегодногоОтпуска", "ВидЕжегодногоОтпуска");
	ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("Сотрудник", "Сотрудник");
	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();

	Попытка
		БлокировкаДанных.Заблокировать();
		
		Для Каждого СтрокаТаблицы Из ТаблицаОбновления Цикл
			НаборЗаписей = РегистрыСведений.ОбновлениеАналитикиОстатковОтпусков.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Сотрудник.Установить(СтрокаТаблицы.Сотрудник);
			НаборЗаписей.Отбор.ВидЕжегодногоОтпуска.Установить(СтрокаТаблицы.ВидЕжегодногоОтпуска);
			НаборЗаписей.Прочитать();
			
			ОбновитьДатуЗаписи = Истина;
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.Дата < СтрокаТаблицы.Дата Тогда
					ОбновитьДатуЗаписи = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Не ОбновитьДатуЗаписи Тогда
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей.Очистить();
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СтрокаТаблицы);
			НаборЗаписей.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Аналитика данных.Регистрация обновления аналитики остатков отпусков'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Конструктор таблицы обновления аналитики остатков отпусков.
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Сотрудник - СправочникСсылка.Сотрудники
//   * ВидЕжегодногоОтпуска - СправочникСсылка.ВидыОтпусков
Функция НоваяТаблицаОбновлениеАналитикиОстатковОтпусков() Экспорт
	Возврат ОбщегоНазначенияБЗК.ТаблицаЗначенийПоИмениРегистраСведений("ОбновлениеАналитикиОстатковОтпусков");
КонецФункции

Функция НоваяТаблицаАналитикаОстатковОтпусков()
	Возврат ОбщегоНазначенияБЗК.ТаблицаЗначенийПоИмениРегистраСведений("АналитикаОстатковОтпусков");
КонецФункции

Функция НоваяТаблицаЗаработанныеПраваНаОтпуска()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Таблица.Колонки.Добавить("ВидЕжегодногоОтпуска", Новый ОписаниеТипов("СправочникСсылка.ВидыОтпусков"));
	Таблица.Колонки.Добавить("КоличествоДней", Новый ОписаниеТипов("Число"));
	
	Возврат Таблица;
	
КонецФункции

Функция ТаблицаЗаработанныхПравНаОтпускаСДатыНачалаАналитики(ТаблицаДанных)
	
	НоваяТаблицаОтпусков = НоваяТаблицаЗаработанныеПраваНаОтпуска();
	ДатаНачалаАналитики = АналитикаДанных.ДатаНачалаАналитики();
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		Если ДатаНачалаАналитики > СтрокаТаблицы.Период Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = НоваяТаблицаОтпусков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
	КонецЦикла;
	
	Возврат НоваяТаблицаОтпусков;
	
КонецФункции

Функция ТаблицаОбновленияЗаработанныхПравНаОтпуска(Источник)
	
	ТаблицаОбновления = НоваяТаблицаОбновлениеАналитикиОстатковОтпусков();
	НаборЗаписей = ТаблицаЗаработанныхПравНаОтпускаСДатыНачалаАналитики(Источник);
	
	Если Не Источник.ДополнительныеСвойства.Свойство("ПрежнийНабор") Тогда
		Возврат НаборЗаписей;
	КонецЕсли;
	
	ПрежнийНабор = ТаблицаЗаработанныхПравНаОтпускаСДатыНачалаАналитики(Источник.ДополнительныеСвойства["ПрежнийНабор"]);
	
	НаборЗаписей.Колонки.Добавить("Счетчик", Новый ОписаниеТипов("Число"));
	НаборЗаписей.ЗаполнитьЗначения(1, "Счетчик");
	
	Для Каждого Строка Из ПрежнийНабор Цикл
		НоваяСтрока = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Счетчик = -1;
	КонецЦикла;
	
	НаборЗаписей.Свернуть("Период, Сотрудник, ВидЕжегодногоОтпуска, КоличествоДней", "Счетчик");
	
	Для Каждого СтрокаНабора Из НаборЗаписей Цикл
		Если СтрокаНабора.Счетчик = 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТаблицаОбновления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНабора);
		НоваяСтрока.Дата = СтрокаНабора.Период;
	КонецЦикла;
	
	Возврат ТаблицаОбновления;
	
КонецФункции

Функция ТаблицаОбновленияФактическихОтпусков(Источник)
	
	ТаблицаОбновления = НоваяТаблицаОбновлениеАналитикиОстатковОтпусков();
	
	Если Не Источник.ДополнительныеСвойства.Свойство("ПрежнийНабор") Тогда
		Возврат Источник.Выгрузить();
	КонецЕсли;
	
	ПрежнийНабор = Источник.ДополнительныеСвойства["ПрежнийНабор"]; // ТаблицаЗначений
	
	Если ОбщегоНазначения.КоллекцииИдентичны(ПрежнийНабор, Источник, "Период, Сотрудник, ВидЕжегодногоОтпуска, Количество") Тогда
		Возврат ТаблицаОбновления;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицыИсточник Из Источник Цикл
		НоваяСтрока = ТаблицаОбновления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыИсточник);
		НоваяСтрока.Дата = СтрокаТаблицыИсточник.Период;
	КонецЦикла;
	
	Для Каждого СтрокаТаблицыИсточник Из ПрежнийНабор Цикл
		НоваяСтрока = ТаблицаОбновления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыИсточник);
		НоваяСтрока.Дата = СтрокаТаблицыИсточник.Период;
	КонецЦикла;
	
	Возврат ТаблицаОбновления;
	
КонецФункции

Функция СвернутаяТаблицаОбновленияАналитикиОстатковОтпусков(ТаблицаОбновления)
	
	НоваяТаблицаОбновления = НоваяТаблицаОбновлениеАналитикиОстатковОтпусков();
	ДатаНачалаАналитики = АналитикаДанных.ДатаНачалаАналитики();
	Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
	ВидЕжегодногоОтпуска = Справочники.ВидыОтпусков.ПустаяСсылка();
	
	ТаблицаОбновления.Сортировать("Сотрудник, ВидЕжегодногоОтпуска, Дата");
	Для Каждого СтрокаТаблицы Из ТаблицаОбновления Цикл
		Если ДатаНачалаАналитики > СтрокаТаблицы.Дата Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаТаблицы.Сотрудник = Сотрудник И СтрокаТаблицы.ВидЕжегодногоОтпуска = ВидЕжегодногоОтпуска Тогда
			Продолжить;
		КонецЕсли;
		Сотрудник = СтрокаТаблицы.Сотрудник;
		ВидЕжегодногоОтпуска = СтрокаТаблицы.ВидЕжегодногоОтпуска;
		ЗаполнитьЗначенияСвойств(НоваяТаблицаОбновления.Добавить(), СтрокаТаблицы);
	КонецЦикла;
	
	Возврат НоваяТаблицаОбновления;
	
КонецФункции

#Область ОстаткиОтпусков

Процедура ОбновитьАналитикуОстатковОтпусков(Сотрудники = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ДанныеНабора.Сотрудник КАК Сотрудник,
		|	ДанныеНабора.ВидЕжегодногоОтпуска КАК ВидЕжегодногоОтпуска,
		|	ДанныеНабора.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.ОбновлениеАналитикиОстатковОтпусков КАК ДанныеНабора
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеНабора.Сотрудник,
		|	ДанныеНабора.ВидЕжегодногоОтпуска";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	Если Сотрудники <> Неопределено Тогда
		ОтборЗапроса.Добавить("ДанныеНабора.Сотрудник В(&Сотрудники)");
		Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	КонецЕсли;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пока Истина Цикл
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОбновлениеАналитикиОстатковОтпусков"); 
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сотрудник", "Сотрудник");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ВидЕжегодногоОтпуска", "ВидЕжегодногоОтпуска");
		
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			ТаблицаОбновления = РезультатЗапроса.Выгрузить();
			ОбновитьАналитикуОстатковОтпусковПоТаблице(ТаблицаОбновления);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Обновить аналитику остатков отпусков по таблице значений.
// 
// Параметры:
//  ТаблицаОбновления - ТаблицаЗначений:
//   * Дата - Дата
//   * Сотрудник - СправочникСсылка.Сотрудники
//   * ВидЕжегодногоОтпуска - СправочникСсылка.ВидыОтпусков
Процедура ОбновитьАналитикуОстатковОтпусковПоТаблице(ТаблицаОбновления)
	
	АналитикаОстатковОтпусков = НоваяТаблицаАналитикаОстатковОтпусков();
	ЗаполнитьТаблицуАналитикиОстатковОтпусков(АналитикаОстатковОтпусков, ТаблицаОбновления);
	АналитикаОстатковОтпусков.Индексы.Добавить("Сотрудник");
	АналитикаОстатковОтпусков.Индексы.Добавить("ВидЕжегодногоОтпуска");
	
	Для Каждого СтрокаТаблицы Из ТаблицаОбновления Цикл
		// Заполняем набор аналитики.
		НаборАналитика = РегистрыСведений.АналитикаОстатковОтпусков.СоздатьНаборЗаписей();
		НаборАналитика.Отбор.Сотрудник.Установить(СтрокаТаблицы.Сотрудник);
		НаборАналитика.Отбор.ВидЕжегодногоОтпуска.Установить(СтрокаТаблицы.ВидЕжегодногоОтпуска);
		НаборАналитика.Прочитать();
		
		АналитикаДанных.УдалитьСтрокиАналитикиПослеДатыОтбора(НаборАналитика, НачалоМесяца(СтрокаТаблицы.Дата));
		
		// Дополняем набор аналитики новыми строками.
		ОтборСтрок = Новый Структура("Сотрудник,ВидЕжегодногоОтпуска", СтрокаТаблицы.Сотрудник,СтрокаТаблицы.ВидЕжегодногоОтпуска);
		НайденныеСтроки = АналитикаОстатковОтпусков.НайтиСтроки(ОтборСтрок);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НайденныеСтроки, НаборАналитика);
		
		// Подготавливаем к очистке набор обновления.
		НаборОбновления = РегистрыСведений.ОбновлениеАналитикиОстатковОтпусков.СоздатьНаборЗаписей();
		НаборОбновления.Отбор.Сотрудник.Установить(СтрокаТаблицы.Сотрудник);
		НаборОбновления.Отбор.ВидЕжегодногоОтпуска.Установить(СтрокаТаблицы.ВидЕжегодногоОтпуска);
		НачатьТранзакцию();
		Попытка
			НаборАналитика.Записать();
			НаборОбновления.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуАналитикиОстатковОтпусков(АналитикаОстатковОтпусков, ТаблицаОбновления)
	
	Если ТаблицаОбновления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ДатаНачалаАналитики = АналитикаДанных.ДатаНачалаАналитики();
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиДляОбновления.Сотрудник КАК Сотрудник,
		|	&ДатаНачала КАК ДатаНачала,
		|	&ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	&ТаблицаОбновления КАК СотрудникиДляОбновления";
	
	Запрос.УстановитьПараметр("ТаблицаОбновления", ТаблицаОбновления);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаАналитики);
	Запрос.УстановитьПараметр("ДатаОкончания", ТекущаяДата);
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = ОстаткиОтпусков.ОписательВременныхТаблицДляСоздатьВТЗаработанныеПраваНаОтпуска(
		Запрос.МенеджерВременныхТаблиц, "ВТСотрудники", "Сотрудник, ДатаНачала, ДатаОкончания");
	ОстаткиОтпусков.СоздатьВТЗаработанныеПраваНаОтпуска(ОписательВременныхТаблиц, Истина);
	
	ОписательВременныхТаблиц = ОстаткиОтпусков.ОписательВременныхТаблицДляСоздатьВТФактическиеОтпускаСотрудников(
		Запрос.МенеджерВременныхТаблиц, "ВТСотрудники", "Сотрудник, ДатаНачала, ДатаОкончания");
	ОстаткиОтпусков.СоздатьВТФактическиеОтпускаСотрудников(ОписательВременныхТаблиц, Истина);
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(МенеджерВременныхТаблиц, ДатаНачалаАналитики, ТекущаяДата);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаОбновления.Сотрудник КАК Сотрудник,
		|	ТаблицаОбновления.ВидЕжегодногоОтпуска КАК ВидЕжегодногоОтпуска,
		|	НАЧАЛОПЕРИОДА(ТаблицаОбновления.Дата, МЕСЯЦ) КАК Дата
		|ПОМЕСТИТЬ ВТТаблицаОбновления
		|ИЗ
		|	&ТаблицаОбновления КАК ТаблицаОбновления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	ВидЕжегодногоОтпуска,
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Периоды.Период КАК Период,
		|	ТаблицаОбновления.Сотрудник КАК Сотрудник,
		|	ТаблицаОбновления.ВидЕжегодногоОтпуска КАК ВидЕжегодногоОтпуска
		|ПОМЕСТИТЬ ВТОстаткиОтпусков
		|ИЗ
		|	ВТТаблицаОбновления КАК ТаблицаОбновления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериоды КАК Периоды
		|		ПО (Периоды.Период >= ТаблицаОбновления.Дата)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	Сотрудник,
		|	ВидЕжегодногоОтпуска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаработанныеПраваНаОтпуска.Сотрудник КАК Сотрудник,
		|	ЗаработанныеПраваНаОтпуска.ВидЕжегодногоОтпуска КАК ВидЕжегодногоОтпуска,
		|	НАЧАЛОПЕРИОДА(ЗаработанныеПраваНаОтпуска.Период, МЕСЯЦ) КАК Период,
		|	СУММА(ЗаработанныеПраваНаОтпуска.КоличествоДней) КАК КоличествоДней,
		|	СУММА(ЗаработанныеПраваНаОтпуска.КоличествоДнейЗаПериод) КАК КоличествоДнейЗаПериод
		|ПОМЕСТИТЬ ВТЗаработанныеПрава
		|ИЗ
		|	ВТЗаработанныеПраваНаОтпуска КАК ЗаработанныеПраваНаОтпуска
		|ГДЕ
		|	ЗаработанныеПраваНаОтпуска.Период <= &ТекущаяДата
		|	И ЗаработанныеПраваНаОтпуска.ВидЕжегодногоОтпуска.ОтпускЯвляетсяЕжегодным
		|	И (НАЧАЛОПЕРИОДА(ЗаработанныеПраваНаОтпуска.Период, МЕСЯЦ), ЗаработанныеПраваНаОтпуска.Сотрудник, ЗаработанныеПраваНаОтпуска.ВидЕжегодногоОтпуска) В
		|			(ВЫБРАТЬ
		|				Т.Период,
		|				Т.Сотрудник,
		|				Т.ВидЕжегодногоОтпуска
		|			ИЗ
		|				ВТОстаткиОтпусков КАК Т)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаработанныеПраваНаОтпуска.Сотрудник,
		|	ЗаработанныеПраваНаОтпуска.ВидЕжегодногоОтпуска,
		|	НАЧАЛОПЕРИОДА(ЗаработанныеПраваНаОтпуска.Период, МЕСЯЦ)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	ВидЕжегодногоОтпуска,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачальныеОстаткиОтпусков.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(НачальныеОстаткиОтпусков.ДатаОстатка) КАК ДатаОстатка
		|ПОМЕСТИТЬ ВТНачальныеОстатки
		|ИЗ
		|	РегистрСведений.НачальныеОстаткиОтпусков КАК НачальныеОстаткиОтпусков
		|ГДЕ
		|	(НачальныеОстаткиОтпусков.Сотрудник, НачальныеОстаткиОтпусков.ВидЕжегодногоОтпуска) В
		|			(ВЫБРАТЬ
		|				Т.Сотрудник,
		|				Т.ВидЕжегодногоОтпуска
		|			ИЗ
		|				ВТТаблицаОбновления КАК Т)
		|
		|СГРУППИРОВАТЬ ПО
		|	НачальныеОстаткиОтпусков.Сотрудник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	ДатаОстатка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(ФактическиеОтпуска.ДатаНачала, МЕСЯЦ) КАК Период,
		|	ФактическиеОтпуска.Сотрудник КАК Сотрудник,
		|	ФактическиеОтпуска.ВидЕжегодногоОтпуска КАК ВидЕжегодногоОтпуска,
		|	СУММА(ФактическиеОтпуска.КоличествоДней) КАК Отгуляно
		|ПОМЕСТИТЬ ВТУчитываемыеОтпускаСотрудников
		|ИЗ
		|	ВТФактическиеОтпускаСотрудников КАК ФактическиеОтпуска
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачальныеОстатки КАК ВТНачальныеОстатки
		|		ПО ФактическиеОтпуска.Сотрудник = ВТНачальныеОстатки.Сотрудник
		|ГДЕ
		|	(НАЧАЛОПЕРИОДА(ФактическиеОтпуска.ДатаНачала, МЕСЯЦ), ФактическиеОтпуска.Сотрудник, ФактическиеОтпуска.ВидЕжегодногоОтпуска) В
		|			(ВЫБРАТЬ
		|				Т.Период,
		|				Т.Сотрудник,
		|				Т.ВидЕжегодногоОтпуска
		|			ИЗ
		|				ВТОстаткиОтпусков КАК Т)
		|	И ФактическиеОтпуска.ВидЕжегодногоОтпуска.ОтпускЯвляетсяЕжегодным
		|	И ФактическиеОтпуска.ДатаНачала >= ЕСТЬNULL(ВТНачальныеОстатки.ДатаОстатка, ДАТАВРЕМЯ(1, 1, 1))
		|	И ФактическиеОтпуска.ДатаНачала <= КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ФактическиеОтпуска.ДатаНачала, МЕСЯЦ),
		|	ФактическиеОтпуска.Сотрудник,
		|	ФактическиеОтпуска.ВидЕжегодногоОтпуска
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	ВидЕжегодногоОтпуска,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаработанныеПрава.Сотрудник КАК Сотрудник,
		|	ЗаработанныеПрава.ВидЕжегодногоОтпуска КАК ВидЕжегодногоОтпуска,
		|	ЗаработанныеПрава.Период КАК Период,
		|	ЗаработанныеПрава.КоличествоДней - СУММА(ЕСТЬNULL(УчитываемыеОтпускаСотрудников.Отгуляно, 0)) КАК ОстатокДней
		|ПОМЕСТИТЬ ВТИтоговыеОстаткиОтпусков
		|ИЗ
		|	ВТЗаработанныеПрава КАК ЗаработанныеПрава
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУчитываемыеОтпускаСотрудников КАК УчитываемыеОтпускаСотрудников
		|		ПО ЗаработанныеПрава.Сотрудник = УчитываемыеОтпускаСотрудников.Сотрудник
		|			И ЗаработанныеПрава.ВидЕжегодногоОтпуска = УчитываемыеОтпускаСотрудников.ВидЕжегодногоОтпуска
		|			И ЗаработанныеПрава.Период >= УчитываемыеОтпускаСотрудников.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаработанныеПрава.Сотрудник,
		|	ЗаработанныеПрава.ВидЕжегодногоОтпуска,
		|	ЗаработанныеПрава.КоличествоДней,
		|	ЗаработанныеПрава.Период
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	Сотрудник";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
		Запрос.МенеджерВременныхТаблиц, "ВТИтоговыеОстаткиОтпусков");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, "МестоВСтруктуреПредприятия");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИтоговыеОстаткиОтпусков.Сотрудник КАК Сотрудник,
		|	ИтоговыеОстаткиОтпусков.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИтоговыеОстаткиОтпусков.ВидЕжегодногоОтпуска КАК ВидЕжегодногоОтпуска,
		|	ИтоговыеОстаткиОтпусков.Период КАК Дата,
		|	ИтоговыеОстаткиОтпусков.ОстатокДней КАК ОстатокДней,
		|	КадровыеДанныеСотрудников.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия
		|ИЗ
		|	ВТИтоговыеОстаткиОтпусков КАК ИтоговыеОстаткиОтпусков
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ПО ИтоговыеОстаткиОтпусков.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|		И ИтоговыеОстаткиОтпусков.Период = КадровыеДанныеСотрудников.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	ВидЕжегодногоОтпуска,
		|	Дата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = АналитикаОстатковОтпусков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
